Revit 2026 API

# AssetPropertyInt64Value Property

---

Get the value of the property.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public long Value { get; }
```
```vb
Public ReadOnly Property Value As Long
	Get
```
```cpp
public:
property long long Value {
	long long get ();
}
```
```fsharp
member Value : int64 with get
```

#### Property Value

Int64

#### Reference

AssetPropertyInt64 Class

Autodesk.Revit.DB.Visual Namespace